README.md
```mermaid
graph LR
	
	Animalia --> Porifera
	Animalia --> Cnidaria
	Animalia --> Ctenophora
	Animalia --> Acanthocephala
	Animalia --> Brachiopoda
	Animalia --> Bryozoa
	Animalia --> Gastrotricha
	Animalia --> Platyhelminthes
	Animalia --> Annelida
	Animalia --> Sipuncula
	Animalia --> Mollusca
	Animalia --> Nemertea
	Animalia --> Chaetognatha
	Animalia --> Rotifera
	Animalia --> Kinorhyncha
	Animalia --> Nematomorpha
	Animalia --> Nematoda
	Animalia --> Tardigrada
	Animalia --> Onychophora
	
	
	
	Animalia --> Arthropoda
	
	
	Arthropoda --> Arachnida
	Arthropoda --> Pycnogonida
	Arthropoda --> Chilopoda
	Arthropoda --> Diplopoda
	Arthropoda --> Malacostraca
	Arthropoda --> Ostracoda
	Arthropoda --> Collembola
	
	
	
	Arthropoda --> Insecta
	
	
	
	Insecta --> Archaeognatha
	Insecta --> Blattodea
	Insecta --> Diptera
	Insecta --> Coleoptera
	Insecta --> Dermaptera
	Insecta --> Embioptera
	Insecta --> Ephemeroptera
	Insecta --> Hemiptera
	Insecta --> Hymenoptera
	Insecta --> Lepidoptera
	Insecta --> Mantodea
	Insecta --> Mecoptera
	Insecta --> Megaloptera
	Insecta --> Neuroptera
	Insecta --> Odonata
	Insecta --> Orthoptera
	Insecta --> Phasmatodea
	Insecta --> Plecoptera
	Insecta --> Psocodea
	Insecta --> Raphidioptera
	Insecta --> Siphonaptera
	Insecta --> Strepsiptera
	Insecta --> Thysanoptera
	Insecta --> Trichoptera
	
	Hymenoptera --> Apidae
	Hymenoptera --> Formicidae
	Hymenoptera --> Vespidae
	
	
	Diptera --> Culicidae
	Diptera --> Drosophilidae
	
	Lepidoptera --> Geometridae
	Lepidoptera --> Lycaenidae
	Lepidoptera --> Noctuidae
	Lepidoptera --> Nymphalidae
	Lepidoptera --> Papilionidae
	Lepidoptera --> Pieridae
	Lepidoptera --> Pyralidae
	Lepidoptera --> Saturniidae
	Lepidoptera --> Sphingidae
	Lepidoptera --> Uraniidae
	
	
	Animalia --> Echinodermata
	Animalia --> Hemichordata
	
	
	Animalia --> Chordata
	
	Chordata --> Leptocardii 
	Chordata --> Ascidiacea 
	Chordata --> Cephalaspidomorphi 
	
	Chordata --> Elasmobranchii 
	Chordata --> Actinopterygii
	Chordata --> Sarcopterygii
	Chordata --> Amphibia
	
	
	
	Chordata --> Reptilia
	
	Reptilia --> Squamata 
	Reptilia --> Testudines
	Reptilia --> Crocodylia
	
	Chordata --> Aves
	Chordata --> Mammalia
```
